#!/usr/bin/python3
#Система параметризации структуры данных, написанная для встраивания контекста в объекты JSON
import json

"""
Модуль отвечает за запись в файл, для дальнейшего удобного парсинга
Приинимает: JSON объект(строку) и путь, кода должен быть сохранен файл
"""

"""
В дальнейшем удобно будет сразу передавать в модуль, отвечающий за объединение файла с распознанным текстом и файла с идентифицированными спикерами в итоговый файл - результат
"""

def save_in_file(json_obj, path):		
	f = open(path, 'w')
	#вытаскиваю результат из строки в JSON формате
	jsonData = json.loads(json_obj)

	for data in jsonData:
		#Проверка на пустоту
		if 'result' in data:
			part = data["result"]
			for i in part:
				print(i)
				f.write(str(i["start"]) + "/" + str(i["word"]) +"/"+str(i["end"])+" " )
		
	f.close()
	
"""
Запись в файл в следующем формате:
время начала произнесения слова / слово / время окончания произнесения слова"""
